tap "databricks/tap"
tap "nikitabobko/tap"
tap "vcmi/vcmi"
# Search tool like grep, but optimized for programmers
brew "ack"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Convert CD images from .bin/.cue to .iso/.cdr
brew "bchunk"
# GNU binary tools for native development
brew "binutils"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Encrypt and decrypt files and streams
brew "ccrypt"
# Browse, inspect, and launch movie torrents directly from your terminal
brew "cinecli"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Development kit for the Java programming language
brew "openjdk"
# Clojure to JS compiler
brew "clojurescript"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Next-gen compiler infrastructure
brew "llvm"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Text processing system for reStructuredText
brew "docutils"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "sdl2-compat"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Free lossless audio codec
brew "flac"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# GitHub command-line tool
brew "gh"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# API and commands for processing SPIR-V modules
brew "spirv-tools"
# OpenGL and OpenGL ES reference compiler for shading languages
brew "glslang"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generic library support script
brew "libtool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Implementation of the Smalltalk language
brew "gnu-smalltalk"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Selection-based modal text editor
brew "kakoune"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Implementation of the file(1) command
brew "libmagic"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Vorbis general audio compression codec
brew "libvorbis"
# LLM inference in C/C++
brew "llama.cpp"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# GUI for vim, made for macOS
brew "macvim"
# MPEG audio decoder
brew "mad"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Build and publish Rust crates as Python packages
brew "maturin"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# API for decoding and seeking in .opus files
brew "opusfile"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@16", restart_service: :changed, link: true
# Monitor data's progress through a pipe
brew "pv"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Spreadsheet program for the terminal, using ncurses
brew "sc-im"
# Database of common MIME types
brew "shared-mime-info"
# SOcket CAT: netcat on steroids
brew "socat"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Secure Reliable Transport
brew "srt"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal image and video viewer
brew "timg"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Vulkan Header files and API registry
brew "vulkan-headers"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# HTTP benchmarking tool
brew "wrk"
# Tracks most-used directories to make cd smarter
brew "z"
# High-performance, asynchronous messaging library
brew "zeromq"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Clipboard manager for developers
cask "flycut"
# Web browser
cask "google-chrome"
# First person shooter engine
cask "ioquake3"
# Discover, download, and run local LLMs
cask "lm-studio"
# Smalltalk programming system
cask "squeak"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source engine for Heroes of Might & Magic III
cask "vcmi/vcmi/vcmi", trusted: true
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdBlock Pro", id: 1018301773
mas "Flycut", id: 442160987
mas "G2FA", id: 6444865161
mas "iMovie", id: 408981434
mas "Keeper Password Manager", id: 414781829
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "Menu Bar Calendar", id: 1558360383
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pharo Smalltalk", id: 6759073615
mas "Shorts Blocker", id: 6451330524
mas "Telegram", id: 747648890
mas "Windows App", id: 1295203466
vscode "alexcvzz.vscode-sqlite"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "brunoventura.sqltools-athena-driver"
vscode "gerane.theme-idlefingers"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "pdconsec.vscode-print"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "vscodevim.vim"
go "github.com/DarthSim/overmind"
uv "ucode", source: "git+https://github.com/databricks/ucode"
npm "@mermaid-js/mermaid-cli"
npm "@openai/codex"
npm "@vibe-kit/grok-cli"
npm "openclaw"
