tap "databricks/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "minio/stable"
brew "ack"
brew "pycparser"
brew "cffi"
brew "libssh"
brew "ansible"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "gettext"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk@17"
brew "apache-spark"
brew "arp-scan"
brew "awscli"
brew "bchunk"
brew "binutils"
brew "ccrypt"
brew "openjdk"
brew "clojurescript"
brew "cmake"
brew "coreutils"
brew "docutils"
brew "duckdb"
brew "enscript"
brew "flac"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libvorbis"
brew "opus"
brew "pango"
brew "sdl2"
brew "srt"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git-lfs"
brew "glslang"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "guile"
brew "htop"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "libomp", link: true
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "kakoune"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "leiningen"
brew "libmagic"
brew "llama.cpp"
brew "llvm"
brew "ruby"
brew "macvim"
brew "mad"
brew "make"
brew "mas"
brew "rust"
brew "maturin"
brew "ninja"
brew "meson"
brew "molten-vk"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "openjdk@11"
brew "openssl@1.1"
brew "pkcs11-helper"
brew "openvpn"
brew "opusfile"
brew "postgresql@14", restart_service: :changed
brew "pv"
brew "tcl-tk"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rustup"
brew "sc-im"
brew "socat"
brew "speedtest-cli"
brew "spirv-tools"
brew "sshuttle"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "uv"
brew "vulkan-headers"
brew "watch"
brew "wget"
brew "wireshark"
brew "wrk"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "databricks/tap/databricks"
brew "minio/stable/mc"
cask "docker"
cask "flycut"
cask "google-chrome"
cask "gstreamer-development"
cask "gstreamer-runtime"
cask "rar"
cask "skype"
cask "telegram"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
vscode "alexcvzz.vscode-sqlite"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "brunoventura.sqltools-athena-driver"
vscode "gerane.theme-idlefingers"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "pdconsec.vscode-print"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "vscodevim.vim"
